Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition Constructor (Point, Point)
 Creates a new input definition instance with two points.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Point P1,
	Point P2
)
Public Sub New (
	P1 As Point,
	P2 As Point
)
Parameters
P1
Type: Tekla.Structures.Geometry3d.Point
The first point.
P2
Type: Tekla.Structures.Geometry3d.Point
The second point.
See Also
Reference
PluginBase.InputDefinition Class
PluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace